miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_cdataio.c
/* Callback function of USB Read/USB Write */
void (*g_usb_callback[]) (usb_utr_t *, uint16_t, uint16_t) =
{
    /* PCDC, PCDCC */
#if defined(USB_CFG_PCDC_USE)
        usb_pcdc_read_complete, usb_pcdc_write_complete, /* USB_PCDC  (0) */
        USB_NULL, usb_pcdc_write_complete, /* USB_PCDCC (1) */
#else
        USB_NULL, USB_NULL, /* USB_PCDC  (0) */
        USB_NULL, USB_NULL, /* USB_PCDCC (1) */
#endif

        /* PHID */
#if defined(USB_CFG_PHID_USE)
        usb_phid_read_complete, usb_phid_write_complete, /* USB_PHID (2) */
#else
        USB_NULL, USB_NULL, /* USB_PHID (2) */
#endif

        /* PVNDR */
#if defined(USB_CFG_PVNDR_USE)
        usb_pvndr_read_complete, usb_pnvdr_write_complete, /* USB_PVND  (3) */
#else
        USB_NULL, USB_NULL, /* USB_PVND  (3) */
#endif

        /* HCDC, HCDCC */
#if defined(USB_CFG_HCDC_USE)
        usb_hcdc_read_complete, usb_hcdc_write_complete, /* USB_HCDC  (4) */
        usb_hcdc_read_complete, USB_NULL, /* USB_HCDCC (5) */
#else
        USB_NULL, USB_NULL, /* USB_HCDC  (4) */
        USB_NULL, USB_NULL, /* USB_HCDCC (5) */
#endif

        /* HHID */
#if defined(USB_CFG_HHID_USE)
        usb_hhid_read_complete, usb_hhid_write_complete, /* USB_HHID  (6) */
#else
        USB_NULL, USB_NULL, /* USB_HHID  (6) */
#endif

        /* HVNDR */
#if defined(USB_CFG_HVNDR_USE)
        usb_hvndr_read_complete, usb_hnvdr_write_complete, /* USB_HVND  (7) */
#else
        USB_NULL, USB_NULL, /* USB_HVND  (7) */
#endif

        /* HMSC */
        USB_NULL, USB_NULL, /* USB_HMSC  (8) */

        /* PMSC */
        USB_NULL, USB_NULL, /* USB_PMSC  (9) */
}; /* const void (g_usb_callback[])(usb_utr_t *, uint16_t, uint16_t) */


#if defined(USB_CFG_PCDC_USE)

/* Abstract Control Model Notification - SerialState */
uint8_t g_usb_pcdc_serialstate_table[USB_CDC_SETUP_TBL_BSIZE] =
{
    0xA1,       /* bmRequestType */
    0x20,       /* bNotification:SERIAL_STATE */
    0x00, 0x00, /* wValue:Zero */
    0x00, 0x00, /* wIndex:Interface */
    0x02, 0x00, /* wLength:2 */
    0x00, 0x00, /* Data:UART State bitmap */
};

#endif /* defined(USB_CFG_PCDC_USE) */

usb_pipe_table_t    g_usb_pipe_table[USB_NUM_USBIP][USB_MAXPIPE_NUM+1];

/******************************************************************************
 Renesas Abstracted common data I/O functions
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_select_nak
 Description     : Set the specified pipe PID to send a NAK if the transfer type 
                 : is BULK/INT. 
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t pipe    : Pipe number.
 Return value    : none
 ******************************************************************************/
void usb_cstd_select_nak (usb_utr_t *ptr, uint16_t pipe)
{
    if (USB_MAX_PIPE_NO < pipe)
    {
        return; /* Error */
    }

    /* Check PIPE TYPE */
    if (usb_cstd_get_pipe_type(ptr, pipe) != USB_TYPFIELD_ISO)
    {
        usb_cstd_set_nak(ptr, pipe);
    }
}
/******************************************************************************
 End of function usb_cstd_select_nak
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_debug_hook
 Description     : Debug hook
 Arguments       : uint16_t error_code          : error code
 Return value    : none
 ******************************************************************************/
void usb_cstd_debug_hook (uint16_t error_code)
{
    while (1)
    {
        /* Non */
    }
} /* End of function usb_cstd_debug_hook() */

/******************************************************************************
 Function Name   : usb_ctrl_read
 Description     : Receive process for Control transfer
 Arguments       : usb_ctrl_t *p_ctrl: Control structure for USB API.
                 : uint8_t *buf      : transfer data address
                 : uint32_t size     : transfer length
 Return value    : usb_er_t          : USB_SUCCESS(USB_OK) / USB_ERROR.
 ******************************************************************************/
usb_er_t usb_ctrl_read (usb_ctrl_t *p_ctrl, uint8_t *buf, uint32_t size)
{
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    usb_er_t err;

    if (USB_HOST == g_usb_usbmode)
    {
        g_usb_read_request_size[p_ctrl->module][USB_PIPE0] = size;
        g_usb_hdata[p_ctrl->module][USB_PIPE0].keyword = USB_PIPE0; /* Pipe No */
        g_usb_hdata[p_ctrl->module][USB_PIPE0].p_tranadr = buf; /* Data address */
        g_usb_hdata[p_ctrl->module][USB_PIPE0].tranlen = size; /* Data Size */

        /* Callback function */
        g_usb_hdata[p_ctrl->module][USB_PIPE0].complete = usb_class_request_complete;
        g_usb_ctrl_request[p_ctrl->module][p_ctrl->address].address = p_ctrl->address;
        g_usb_ctrl_request[p_ctrl->module][p_ctrl->address].setup = p_ctrl->setup;

        /* Setup message address set */
        g_usb_hdata[p_ctrl->module][USB_PIPE0].p_setup =
                (uint16_t *) &g_usb_ctrl_request[p_ctrl->module][p_ctrl->address];
        g_usb_hdata[p_ctrl->module][USB_PIPE0].segment = USB_TRAN_END;
        g_usb_hdata[p_ctrl->module][USB_PIPE0].ip = p_ctrl->module;
        g_usb_hdata[p_ctrl->module][USB_PIPE0].ipp = usb_hstd_get_usb_ip_adr((uint8_t) p_ctrl->module);
        err = usb_hstd_transfer_start(&g_usb_hdata[p_ctrl->module][USB_PIPE0]);
        return err;
    }
#endif
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
    if (USB_PERI == g_usb_usbmode)
    {
        if (USB_ON == g_usb_pstd_pipe0_request)
        {
            return USB_QOVR;
        }
        g_usb_read_request_size[USB_CFG_USE_USBIP][USB_PIPE0] = size;
        usb_pstd_ctrl_write(size, buf);
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
    }
#endif
    return USB_SUCCESS;
} /* End of function usb_ctrl_read() */

