miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_cdataio.c
/******************************************************************************
 Function Name   : usb_ctrl_write
 Description     : Send process for Control transfer
 Arguments       : usb_ctrl_t *p_ctrl: Control structure for USB API.
                 : uint8_t *buf      : transfer data address
                 : uint32_t size     : transfer length
 Return value    : usb_er_t          : USB_SUCCESS(USB_OK) / USB_ERROR.
 ******************************************************************************/
usb_er_t usb_ctrl_write (usb_ctrl_t *p_ctrl, uint8_t *buf, uint32_t size)
{
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    usb_er_t err;

    if (USB_HOST == g_usb_usbmode)
    {
        g_usb_read_request_size[p_ctrl->module][USB_PIPE0] = size;
        g_usb_hdata[p_ctrl->module][USB_PIPE0].keyword = USB_PIPE0; /* Pipe No */
        g_usb_hdata[p_ctrl->module][USB_PIPE0].p_tranadr = buf; /* Data address */
        g_usb_hdata[p_ctrl->module][USB_PIPE0].tranlen = size; /* Data Size */

        /* Callback function */
        g_usb_hdata[p_ctrl->module][USB_PIPE0].complete = usb_class_request_complete;
        g_usb_ctrl_request[p_ctrl->module][p_ctrl->address].address = p_ctrl->address;
        g_usb_ctrl_request[p_ctrl->module][p_ctrl->address].setup = p_ctrl->setup;

        /* Setup message address set */
        g_usb_hdata[p_ctrl->module][USB_PIPE0].p_setup =
                (uint16_t *) &g_usb_ctrl_request[p_ctrl->module][p_ctrl->address];
        g_usb_hdata[p_ctrl->module][USB_PIPE0].segment = USB_TRAN_END;
        g_usb_hdata[p_ctrl->module][USB_PIPE0].ip = p_ctrl->module;
        g_usb_hdata[p_ctrl->module][USB_PIPE0].ipp = usb_hstd_get_usb_ip_adr((uint8_t) p_ctrl->module);
        err = usb_hstd_transfer_start(&g_usb_hdata[p_ctrl->module][USB_PIPE0]);
        return err;
    }
#endif
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
    usb_ctrl_t ctrl;

    if (USB_PERI == g_usb_usbmode)
    {
        if ((USB_NULL == buf) && (USB_NULL == size))
        {
            if (USB_ACK == p_ctrl->status)
            {
                usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0);   /* Set BUF */
            }
            else /* USB_STALL */
            {
                usb_pstd_set_stall_pipe0();
            }

            ctrl.setup  = p_ctrl->setup;                            /* Save setup data. */
            ctrl.module = USB_CFG_USE_USBIP;
            ctrl.size   = 0;
            ctrl.status = USB_ACK;
            ctrl.type   = USB_REQUEST;
            usb_set_event(USB_STS_REQUEST_COMPLETE, &ctrl);

        }
        else
        {
            if (USB_ON == g_usb_pstd_pipe0_request)
            {
                return USB_QOVR;
            }
            usb_pstd_ctrl_read(size, buf);
#if (BSP_CFG_RTOS_USED == 1)
            usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        }
    }
#endif
    return USB_SUCCESS;
} /* End of function usb_ctrl_write() */

/******************************************************************************
 Function Name   : usb_ctrl_stop
 Description     : Stop of USB Control transfer.
 Arguments       : usb_ctrl_t *p_ctrl: Control structure for USB API.
 Return value    : usb_er_t          : USB_OK / USB_ERROR.
 ******************************************************************************/
usb_er_t usb_ctrl_stop (usb_ctrl_t *p_ctrl)
{
    usb_er_t err;
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    usb_utr_t utr;
#endif

    if ((p_ctrl->type) > USB_PVND)
    {
        /* ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST ) */
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        utr.ip = p_ctrl->module;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);
        err = usb_hstd_transfer_end(&utr, USB_PIPE0, (uint16_t) USB_DATA_STOP);
#endif
    }
    else
    {
        /* Peripheral only */
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        err = usb_pstd_transfer_end(USB_PIPE0);
#endif
    }
    return err;
} /* End of function usb_ctrl_stop() */

/******************************************************************************
 Function Name   : usb_data_read
 Description     : USB data read processing
 Arguments       : usb_ctrl_t *p_ctrl: Control structure for USB API.
                 : uint8_t *buf      : Transfer data address
                 : uint32_t size     : Transfer length
 Return value    : usb_er_t          : USB_OK / USB_ERROR.
 ******************************************************************************/
usb_er_t usb_data_read (usb_ctrl_t *p_ctrl, uint8_t *buf, uint32_t size)
{
    uint8_t pipe;
    usb_er_t err;

    pipe = usb_get_usepipe(p_ctrl, USB_READ);

    if ((p_ctrl->type) > USB_PVND)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        g_usb_read_request_size[p_ctrl->module][pipe] = size;
        g_usb_hdata[p_ctrl->module][pipe].keyword = pipe; /* Pipe No */
        g_usb_hdata[p_ctrl->module][pipe].p_tranadr = buf; /* Data address */
        g_usb_hdata[p_ctrl->module][pipe].tranlen = size; /* Data Size */
        g_usb_hdata[p_ctrl->module][pipe].complete = g_usb_callback[p_ctrl->type * 2]; /* Callback function */
        g_usb_hdata[p_ctrl->module][pipe].segment = USB_TRAN_END;
        g_usb_hdata[p_ctrl->module][pipe].ip = p_ctrl->module;
        g_usb_hdata[p_ctrl->module][pipe].ipp = usb_hstd_get_usb_ip_adr((uint8_t) p_ctrl->module);
        err = usb_hstd_transfer_start(&g_usb_hdata[p_ctrl->module][pipe]);
#endif
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        g_usb_read_request_size[USB_CFG_USE_USBIP][pipe] = size;
        g_usb_pdata[pipe].keyword = pipe; /* Pipe No */
        g_usb_pdata[pipe].p_tranadr = buf; /* Data address */
        g_usb_pdata[pipe].tranlen = size; /* Data Size */
        g_usb_pdata[pipe].complete = (usb_cb_t)g_usb_callback[p_ctrl->type*2]; /* Callback function */
        err = usb_pstd_transfer_start(&g_usb_pdata[pipe]);
#endif
    }
    return err;
} /* End of function usb_data_read() */

