miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_cdataio.c
#if defined(USB_CFG_PCDC_USE)
        case USB_CFG_PCDC_BULK_IN:
  #if USB_CFG_DTC == USB_CFG_ENABLE
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(8u));
  #else     /* USB_CFG_DTC == USB_CFG_ENABLE */
            pipe_buf = (USB_BUF_SIZE(2048u) | USB_BUF_NUMB(8u));
  #endif    /* USB_CFG_DTC == USB_CFG_ENABLE */
        break;

        case USB_CFG_PCDC_BULK_OUT:
  #if USB_CFG_DTC == USB_CFG_ENABLE
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(36u));
  #else     /* USB_CFG_DTC == USB_CFG_ENABLE */
            pipe_buf = (USB_BUF_SIZE(2048u) | USB_BUF_NUMB(72u));
  #endif    /* USB_CFG_DTC == USB_CFG_ENABLE */
        break;
#endif  /* defined(USB_CFG_PCDC_USE) */

#if defined(USB_CFG_PMSC_USE)
        case USB_CFG_PMSC_BULK_IN:
  #if USB_CFG_DTC == USB_CFG_ENABLE
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(8u));
  #else     /* USB_CFG_DTC == USB_CFG_ENABLE */
            pipe_buf = (USB_BUF_SIZE(2048u) | USB_BUF_NUMB(8u));
  #endif    /* USB_CFG_DTC == USB_CFG_ENABLE */
        break;

        case USB_CFG_PMSC_BULK_OUT:
  #if USB_CFG_DTC == USB_CFG_ENABLE
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(36u));
  #else     /* USB_CFG_DTC == USB_CFG_ENABLE */
            pipe_buf = (USB_BUF_SIZE(2048u) | USB_BUF_NUMB(72u));
  #endif    /* USB_CFG_DTC == USB_CFG_ENABLE */
        break;
#endif  /* defined(USB_CFG_PMSC_USE) */

#if defined(USB_CFG_PVND_USE) || defined(USB_CFG_HVND_USE)
        case USB_PIPE1:
            pipe_buf = (USB_BUF_SIZE(512u) | USB_BUF_NUMB(8u));
        break;
        case USB_PIPE2:
            pipe_buf = (USB_BUF_SIZE(512u) | USB_BUF_NUMB(24u));
        break;
        case USB_PIPE3:
            pipe_buf = (USB_BUF_SIZE(512u) | USB_BUF_NUMB(40u));
        break;
        case USB_PIPE4:
            pipe_buf = (USB_BUF_SIZE(512u) | USB_BUF_NUMB(56u));
        break;
        case USB_PIPE5:
            pipe_buf = (USB_BUF_SIZE(512u) | USB_BUF_NUMB(72u));
        break;
#endif  /* defined(USB_CFG_PVND_USE) || defined(USB_CFG_HVND_USE) */

        case USB_PIPE6:
            pipe_buf = (USB_BUF_SIZE(64u) | USB_BUF_NUMB(4u));
        break;

        case USB_PIPE7:
            pipe_buf = (USB_BUF_SIZE(64u) | USB_BUF_NUMB(5u));
        break;

        case USB_PIPE8:
            pipe_buf = (USB_BUF_SIZE(64u) | USB_BUF_NUMB(6u));
        break;

        case USB_PIPE9:
            pipe_buf = (USB_BUF_SIZE(64u) | USB_BUF_NUMB(7u));
        break;

        default:
            /* Error */
        break;
    }

    return pipe_buf;
} /* End of function usb_cstd_get_pipe_buf_value() */

#endif /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if (BSP_CFG_RTOS_USED == 1)
/******************************************************************************
 Function Name   : get_usb_int_buf
 Description     : USB interrupt routine. Analyze which USB interrupt occurred
                 : and send message to PCD task.
 Arguments       : none
 Return value    : Point to the area for usb_int_t structure
 ******************************************************************************/
usb_utr_t    *get_usb_int_buf(void)
{
    static uint16_t count = 0;
    usb_utr_t       *p;

    p = &g_usb_cstd_int[count];

    count = ((count + 1) % USB_INT_BUFSIZE);

    return p;
}
/******************************************************************************
 End of function get_usb_int_buf
 ******************************************************************************/
#endif /* BSP_CFG_RTOS_USED == 1 */

/******************************************************************************
 End  Of File
 ******************************************************************************/
